package main

import (
	"encoding/json"
	"fmt"
	"log"

	"github.com/MWT-proger/go-category-formatter/internal/category"
	"github.com/MWT-proger/go-category-formatter/internal/models"
)

func main() {
	var result map[string][]string
	var ParentListCategory []*models.Category
	var ChildListCategory []*models.Category
	err := json.Unmarshal([]byte(data), &result)
	if err != nil {
		fmt.Println("Error:", err)
		return
	}

	for parent, children := range result {
		p := category.GenerateCategory(parent)
		ParentListCategory = append(ParentListCategory, p)
		for _, child := range children {
			ch := category.GenerateCategory(child)
			ch.ParentID = p.ID.String()
			ChildListCategory = append(ChildListCategory, ch)
		}
	}
	category.SaveCategoryToFile(ParentListCategory, "parent_category")
	category.SaveCategoryToFile(ChildListCategory, "child_category")
	log.Println("Финиш генерации")

}

const data = `{
    "Садовое оборудование": [
      "Триммеры",
      "Садовые инструменты",
      "Мангалы",
      "Газонокосилки"
    ],
    "Специализированное оборудование": [
      "Промышленное оборудование",
      "Медицинское оборудование",
      "Аудио- и видеоаппаратура"
    ],
    "Товары для детей": [
      "Автокресла",
      "Игрушки",
      "Стульчики для кормления",
      "Коляски",
      "Другое",
      "Детская одежда"
    ],
    "Мебель": [
      "Стулья",
      "Шкафы",
      "Столы",
      "Диваны",
      "Кровати"
    ],
    "Спорт и туризм": [
      "Тренажеры",
      "Снаряжение для занятий спортом",
      "Лодки",
      "Лодки и байдарки",
      "Водные лыжи",
      "Гидрокостюмы ",
      "Сап-доски(Sup-board)",
      "Виндсерфинг",
      "Серфинг",
      "Горные лыжи",
      "Сноуборды",
      "Коньки",
      "Санки и Тюбинги",
      "Палатки и тенты",
      "Походная мебель",
      "Туристические рюкзаки",
      "Надувной матрас",
      "Велосипеды",
      "Другое",
      "Ролики",
      "Лонгборды",
      "Самокаты",
      "Гироскутеры"
    ],
    "Транспорт": [
      "Велосипеды",
      "Автомобили",
      "Скутеры",
      "Мотоциклы",
      "Яхты"
    ],
    "Недвижимость": [
      "Коммерческая недвижимость",
      "Квартиры",
      "Дома",
      "Офисные помещения"
    ],
    "Бытовая техника": [
      "Кондиционеры",
      "Стиральные машины",
      "Холодильники",
      "Пылесосы"
    ],
    "Одежда и стиль": [
      "Платья",
      "Мужские костюмы",
      "Спортивные костюмы",
      "Юбки",
      "Верхняя одежда",
      "Маскарадные костюмы",
      "Украшения",
      "Сумки",
      "Часы",
      "Обувь",
      "Другое"
    ],
    "Игры и развлечения": [
      "Sony Playstation",
      "Xbox",
      "Nintendo",
      "Диски"
    ],
    "Все для праздников": [
      "Подушки и одеяла",
      "Посуда для мероприятий",
      "Декор",
      "Мебель для мероприятий",
      "Свадебные шатры",
      "Прочие товары для мероприятий",
      "Оборудование для мероприятий"
    ],
    "Инструменты": [
      "Измерительные приборы",
      "Спецтехника",
      "Другое для ремонта",
      "Оборудование",
      "Чистящие средства",
      "Ручные инструменты",
      "Сварочное оборудование",
      "Электроинструменты",
      "Инструменты",
      "Обогреватели"
    ],
    "Техника и электроника": [
      "Игровые приставки",
      "Компьютеры",
      "Ноутбуки",
      "Планшеты",
      "Телевизоры"
    ],
    "Хобби и отдых": [
      "Музыка и искусство",
      "Настольные игры",
      "Книги",
      "Тимбилдинг"
    ],
    "Медицинские товары": [
      "Фотолампа от желтухи",
      "Концентраторы кислорода",
      "Медицинские кровати",
      "Инвалидные коляски",
      "Костыли"
    ]
  }`
